## SQL Connection in Python

In [3]:
import mysql.connector

In [4]:
mydb=mysql.connector.connect(host="localhost",user="root",password="Naveen@1301")
print(mydb)

<mysql.connector.connection_cext.CMySQLConnection object at 0x0000022782F27A90>

In [4]:
# creating a database
mycrs=mydb.cursor()
mycrs.execute("create database python_db2")
print(mycrs)

CMySQLCursor: create database python_db2

In [22]:
mycrs.execute("show databases")
for x in mycrs:
    print(x)

('collage',)
('company',)
('emp',)
('emp1',)
('examcell',)
('information_schema',)
('mydb',)
('mysql',)
('performance_schema',)
('python_db',)
('python_db1',)
('python_db2',)
('school',)
('second',)
('sys',)

In [5]:
mydb=mysql.connector.connect(host="localhost",user="root",password="Naveen@1301",database="python_db2")

mycrs=mydb.cursor()
# Creating a table
mycrs.execute("create table student(name varchar(50),id varchar(10),section varchar(5))")

In [6]:
mycrs.execute("desc student")
print(mycrs)
for i in mycrs:
    print(i)

CMySQLCursor: desc student
('name', b'varchar(50)', 'YES', '', None, '')
('id', b'varchar(10)', 'YES', '', None, '')
('section', b'varchar(5)', 'YES', '', None, '')

In [7]:
mycrs.execute("show tables")
for i in mycrs:
    print(i)

('student',)

In [8]:
# Inserting single record 
sql="insert into student(name,id,section) values(%s,%s,%s)"
val=("harish","20jr1a12c9","sec-2")
mycrs.execute(sql,val)
mydb.commit()

In [9]:
print(mycrs.rowcount,"rows are inserted")

1 rows are inserted

In [10]:
mycrs.execute("select * from student")
for i in mycrs:
    print(i)

('harish', '20jr1a12c9', 'sec-2')

In [11]:
# Inserting multiple records at a time
sql="insert into student(name,id,section) values(%s,%s,%s)"
val=[("manju","20jr1a12a6","sec-2"),
    ("avinash","20jr1a12c3","sec-1"),
    ("vaishu","20jr1a12c9","sec-3")]
mycrs.executemany(sql,val)
print(mycrs.rowcount,"rows are inserted")

3 rows are inserted

In [12]:
# Retriving records from table
mycrs.execute("select * from student")
count=0
for i in mycrs:
    count+=1
    print(i)
print(count,"are selected")

('harish', '20jr1a12c9', 'sec-2')
('manju', '20jr1a12a6', 'sec-2')
('avinash', '20jr1a12c3', 'sec-1')
('vaishu', '20jr1a12c9', 'sec-3')
4 are selected

In [13]:
# Select records on where condition
mycrs.execute("select id,section from student where name='harish'")
count=0
for i in mycrs:
    count+=1
    print(i)
print(count," rows are selected")

('20jr1a12c9', 'sec-2')
1  rows are selected

In [14]:
# deleting record from table
mycrs.execute("delete from student where name='avinash'")
mydb.commit()
print(mycrs.rowcount,"Records(s) are deleted..............")

1 Records(s) are deleted..............

In [15]:
mycrs.execute("select * from student")
count=0
for i in mycrs:
    print(i)
    count+=1
print(count,"rows are selected")

('harish', '20jr1a12c9', 'sec-2')
('manju', '20jr1a12a6', 'sec-2')
('vaishu', '20jr1a12c9', 'sec-3')
3 rows are selected

In [16]:
# updating name 
mycrs.execute("update student set name='vamsi' where name='vaishu'")
for i in mycrs:
    print(i)

In [17]:
mycrs.execute("select * from student")
for i in mycrs:
    print(i)
    count+=1
print(count,"rows are selected")

('harish', '20jr1a12c9', 'sec-2')
('manju', '20jr1a12a6', 'sec-2')
('vamsi', '20jr1a12c9', 'sec-3')
6 rows are selected

In [20]:
mycrs.execute("delete from student where name='harish'")

In [21]:
mycrs.execute("select * from student")
count=0
for i in mycrs:
    count+=1
    print(i)
print(count,"rows are selected")

('manju', '20jr1a12a6', 'sec-2')
('vamsi', '20jr1a12c9', 'sec-3')
2 rows are selected

In [13]:
mycrs1.execute("commit")
print(mycrs1)

CMySQLCursor: commit

In [5]:

mydb=mysql.connector.connect(host="localhost",user="root",password="Naveen@1301",database="emp")

mycrs1=mydb.cursor()

In [6]:
mycrs1.execute("show tables")
for i in mycrs1:
    print(i)

('emp3',)
('emp4',)
('emp5',)

In [7]:
mycrs1.execute("desc emp3")
print(mycrs1)
for i in mycrs1:
    print(i)

CMySQLCursor: desc emp3
('emp_id', b'int', 'NO', 'PRI', None, '')
('f_name', b'varchar(50)', 'NO', '', None, '')
('l_name', b'varchar(50)', 'NO', '', None, '')

In [8]:
mycrs1.execute("drop table emp3")
print("successfully droped the table")

successfully droped the table

In [9]:
# successfully drop the table
mycrs1.execute("show tables")
for i in mycrs1:
    print(i)

('emp4',)
('emp5',)

In [12]:
mycrs1.execute("commit")
print(mycrs1)

CMySQLCursor: commit